#+TITLE: Basic Harness
#+Property: header-args :noweb yes
#+Property: header-args:shell :results output
#+PROPERTY: header-args:go :main no :package 'discard

* Setup environment
Simple as possible, follow the grpc example repos...

#+begin_src shell :dir (ii/workdir+ "")
mkdir -p adapter/{adapter,adapter_client,adapter_server}
touch adapter/adapter/adapter.proto
touch adapter/adapter_{client,server}/main.go
tree adapter
#+end_src

#+RESULTS:
: adapter
: ├── adapter
: │   └── adapter.proto
: ├── adapter_client
: │   └── main.go
: └── adapter_server
:     └── main.go
:
: 3 directories, 3 files

** Write up proto schema for compliment server
First iteration is a server-streaming service that brings in a steady stream of
compliments for a named person.

We will create a Complimenter service, with one rpc that shows server-side streaming

#+NAME: Adapter service, v1
#+begin_src c
service Adapter {
  rpc GiveCompliments (Name) returns (stream Compliment){}
}
#+end_src

This rpc mentions two types, which we define as messages

#+NAME: Complimenter Messages
#+begin_src c
message Name {
  string name = 1;
}

message Compliment {
  string message = 1;
}
#+end_src

We can now build the  proto file, with the standard boilerplate of syntax and package name:

#+NAME: adapter proto, v1
#+begin_src  c :tangle (ii/workdir+ "adapter/adapter/adapter.proto")
syntax = "proto3";

option go_package = "github.com/zachmandeville/tester-prototype/adapter/adapter";

package adapter;

<<Adapter service, v1>>

<<Complimenter Messages>>
#+end_src

We can call our [[*Generate protobuf code][Generate protobuf code function]] with this directive

#+CALL: Generate protobuf code() :dir (ii/workdir+ "adapter") :results silent

And will see a few new ~pb.go~ files in our adapter directory.

#+begin_src shell :dir (ii/workdir+ "adapter")
tree
#+end_src

#+RESULTS:
#+begin_example
.
├── adapter
│   ├── adapter.pb.go
│   ├── adapter.proto
│   └── adapter_grpc.pb.go
├── adapter_client
│   └── main.go
└── adapter_server
    └── main.go

3 directories, 5 files
#+end_example

These files have everthing we need to build our server and client.
Let's start with the server!

** Write out our feature

The only thing we are testing now is that the target is a valid gRPC server:
given a port, when I attempt a connection through gRPC, that connection is
successful.

#+NAME: valid target feature
#+begin_src feature  :tangle (ii/workdir+ "features/valid_target.feature")
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program,
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:
    Given a target address
    When I attempt to connect to the address
    Then I get a success message
#+end_src

I will tangle this and run godog, which gives me a nice template to start from.

#+begin_src shell :dir (ii/workdir+ "")
godog
#+end_src

#+RESULTS:
#+begin_example
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program.
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:                                 # features/valid_target.feature:9
    Given a target address
    When I attempt to connect to the address
    Then I get a success message

1 scenarios (1 undefined)
3 steps (3 undefined)
476.472µs

You can implement step definitions for undefined steps with these snippets:

func aTargetAddress() error {
	return godog.ErrPending
}

func iAttemptToConnectToTheAddress() error {
	return godog.ErrPending
}

func iGetASuccessMessage() error {
	return godog.ErrPending
}

func InitializeScenario(ctx *godog.ScenarioContext) {
	ctx.Step(`^a target address$`, aTargetAddress)
	ctx.Step(`^I attempt to connect to the address$`, iAttemptToConnectToTheAddress)
	ctx.Step(`^I get a success message$`, iGetASuccessMessage)
}

#+end_example


I will use this, and my client code, to write valid_target_test.go
** Generate test template
At first, i want to just make sure the test file can be run with godog correctly.
I should get all failed tests, but they should connect to the lines in my code.

#+NAME: valid_target_test.go, v1
#+begin_src go :tangle (ii/workdir+ "valid_target_test.go")
package main

import (
"github.com/cucumber/godog"
)

func aTargetAddress() error {
	return godog.ErrPending
}

func iAttemptToConnectToTheAddress() error {
	return godog.ErrPending
}

func iGetASuccessMessage() error {
	return godog.ErrPending
}

func InitializeScenario(ctx *godog.ScenarioContext) {
	ctx.Step(`^a target address$`, aTargetAddress)
	ctx.Step(`^I attempt to connect to the address$`, iAttemptToConnectToTheAddress)
	ctx.Step(`^I get a success message$`, iGetASuccessMessage)
}
#+end_src

Now when I run godog, I can see it's including these tests

#+begin_src shell :dir (ii/workdir+ "")
godog
#+end_src

#+RESULTS:
#+begin_example
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program.
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:                                 # features/valid_target.feature:9
    Given a target address                   # valid_target_test.go:8 -> aTargetAddress
      TODO: write pending definition
    When I attempt to connect to the address # valid_target_test.go:12 -> iAttemptToConnectToTheAddress
    Then I get a success message             # valid_target_test.go:16 -> iGetASuccessMessage

1 scenarios (1 pending)
3 steps (1 pending, 2 skipped)
1.022862ms
#+end_example

Excellent, let's move through the examples.

*** Check it worked
If this worked, our first step should pass.

#+begin_src shell :dir (ii/workdir+ "")
godog
#+end_src

#+RESULTS:
#+begin_example
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program.
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:                                 # features/valid_target.feature:9
    Given a target address                   # valid_target_test.go:11 -> *runner
    When I attempt to connect to the address # valid_target_test.go:17 -> iAttemptToConnectToTheAddress
      TODO: write pending definition
    Then I get a success message             # valid_target_test.go:21 -> iGetASuccessMessage

1 scenarios (1 pending)
3 steps (1 passed, 1 pending, 1 skipped)
1.182884ms
#+end_example

Sweet!  One down, two to go.
*** Check it worked

Same as before, tangle and godog and we should get the first two steps passing.

#+begin_src shell :dir (ii/workdir+ "")
godog
#+end_src

#+RESULTS:
#+begin_example
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program,
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:                                 # features/valid_target.feature:9
    Given a target address                   # valid_target_test.go:18 -> *runner
    When I attempt to connect to the address # valid_target_test.go:23 -> *runner
    Then I get a success message             # valid_target_test.go:42 -> iGetASuccessMessage
      TODO: write pending definition

1 scenarios (1 pending)
3 steps (2 passed, 1 pending)
8.963425ms
#+end_example

Almost there!

*** Check it worked

This should be all green now.

#+begin_src shell :dir (ii/workdir+ "")
godog
#+end_src

#+RESULTS:
#+begin_example
Feature: Valid Test Target
  as a test runner
  I want a target I can reach with my program,
  so i can run my tests.

  Rules:
  - target address is 18000

  Scenario:                                 # features/valid_target.feature:9
    Given a target address                   # valid_target_test.go:18 -> *runner
    When I attempt to connect to the address # valid_target_test.go:23 -> *runner
    Then I get a success message             # valid_target_test.go:41 -> *runner

1 scenarios (1 passed)
3 steps (3 passed)
9.645969ms
#+end_example

Incredible.

